
{- фунція, що перевряє чи x є простим числом -}
isPrime :: Int -> Bool
isPrime x   | x < 2          = False
            | otherwise      = prime (2:[3,4..(x-1)])
    where 
        prime (y:z)
            | x < y ^ 2      = True
            | x `mod` y == 0 = False
            | otherwise      = prime z
            
{- фунція, що прохоиться по кожному елементу першого і друго списку
комбінуючи їх по черзі. Одночасно перевіряється умова що різниця між числами == 2
і оскільки hasell має ліниві булеві оператори, то наступні умови, що перевіряють чи обоє числа є простими
будуть перевірені, якщо числа мають різницю рівною 2
-}            
task xs ys = [ (x,y)| x<-xs, y<-ys, ((y-x) == 2) && (isPrime x) && (isPrime y) ]           
      

main = do
    print $ task [1..20] [1..20]